Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes
The ReinforcementGroupAttributes class is the base attributes class for
ReinforcementGroup.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.ReinforcementVisibility
Defines which bars in the group appear in drawings.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.StraightEndSymbolType
Defines how the straight ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.HookedEndSymbolType
Defines how the hooked ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.#ctor
Creates a new default reinforcement attributes instance that loads standard attributes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.#ctor(System.Boolean)
Creates a new default reinforcement attributes instance that loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be loaded.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.#ctor(System.String)
Creates a new reinforcement attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.